feijie825/gonghao/LM3S21xx_systick.c
/******************** (C) COPYRIGHT 2008 LUMINARY LM3S21xx ********************
;* File Name          : LM3S21xx_systick.c
;* Author             : 张力阵
;* 系统节拍定时器驱动
*******************************************************************************/
#include "LM3S2139.h"
#include "LM3S21xx_Lib.h"
#include "LM3S21xx_types.h"
#include "define.h"
#include "vari.h"
/*****************************************************************************
* 初始化系统节拍定时器 
*****************************************************************************/
void Init_SysTick(void)
{
    SysTickPeriodSet((Sysclk/1000000)*SYS_TIME); //设置系统节拍定时周期
    SysTickEnable();			//使能系统节拍定时器
    SysTickIntEnable();			//使能系统节拍定时器中断
}

/*****************************************************************************
* 使能系统定时器 
*****************************************************************************/
void SysTickEnable(void)
{
    NVIC->ST_CTRL |= (NVIC_ST_CTRL_CLK_SRC | NVIC_ST_CTRL_ENABLE);
}

/*****************************************************************************
* 禁能系统定时器 
*****************************************************************************/
void SysTickDisable(void)
{
    NVIC->ST_CTRL &= ~(NVIC_ST_CTRL_ENABLE);
}

/*****************************************************************************
* 设置系统定时器 中断服务程序入口
* 使能SysTick 定时中断
*****************************************************************************/
void SysTickIntRegister(void (*pfnHandler)(void))
{
    IntRegister(FAULT_SYSTICK, pfnHandler);
    NVIC->ST_CTRL |= NVIC_ST_CTRL_INTEN;
}

/*****************************************************************************
* 禁能SysTick 定时中断
* 撤销系统定时器 中断服务程序
*****************************************************************************/
void SysTickIntUnregister(void)
{
    NVIC->ST_CTRL &= ~(NVIC_ST_CTRL_INTEN);
    IntUnregister(FAULT_SYSTICK);
}

/*****************************************************************************
* 使能SysTick 定时中断
*****************************************************************************/
void SysTickIntEnable(void)
{
    NVIC->ST_CTRL |= NVIC_ST_CTRL_INTEN;
}

/*****************************************************************************
* 禁能SysTick 定时中断
*****************************************************************************/
void SysTickIntDisable(void)
{
    NVIC->ST_CTRL &= ~(NVIC_ST_CTRL_INTEN);
}

/*****************************************************************************
* 设置SysTick 定时中断周期
* 入口 ulPeriod SysTick中断周期
*****************************************************************************/
void SysTickPeriodSet(u32 ulPeriod)
{
    ASSERT((ulPeriod > 0) && (ulPeriod <= 16777216));

    NVIC->ST_RELOAD = ulPeriod - 1;
}

/*****************************************************************************
* 获取SysTick周期 
* 返回系统时钟个数
*****************************************************************************/
u32 SysTickPeriodGet(void)
{
    return(NVIC->ST_RELOAD + 1);
}

/*****************************************************************************
* 获取SysTick定时器当前值
* 返回SysTick当前值
*****************************************************************************/
u32	SysTickValueGet(void)
{
    return(NVIC->ST_CURRENT);
}

